; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain zenotravel)
;(:requirements :typing :fluents)
(:types locatable city - object
	aircraft person - locatable)
(:predicates (located ?x - locatable  ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (located ?p ?c)
                 (located ?a ?c))
 :effect (and (not (located ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (located ?a ?c))
 :effect (and (not (in ?p ?a))
              (located ?p ?c)
		(decrease (onboard ?a) 1)))

(:action flyslow
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (located ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (located ?a ?c1))
              (located ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action flyfast
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (located ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (located ?a ?c1))
              (located ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft)
 :precondition (and (> (capacity ?a) (fuel ?a))

		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-10)
(:domain zenotravel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person

	Denver - city
	Dallas - city
	Washington - city
	Seattle - city
	Boston - city
	LosAngeles - city
	)
(:init
	(located plane1 Boston)
	(= (capacity plane1) 2326)
	(= (fuel plane1) 205)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(located plane2 Washington)
	(= (capacity plane2) 12132)
	(= (fuel plane2) 1469)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 9)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 9)
	(located plane3 Seattle)
	(= (capacity plane3) 5204)
	(= (fuel plane3) 1532)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 7)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 8)
	(located person1 Dallas)
	(located person2 Washington)
	(located person3 Dallas)
	(located person4 Boston)
	(located person5 LosAngeles)
	(located person6 Dallas)
	(located person7 Denver)
	(located person8 Washington)
	(located person9 Dallas)
	(located person10 LosAngeles)
	
	(= (distance Denver Dallas) 1068)
	(= (distance Dallas Denver) 1068)
	(= (distance Denver Washington) 2397)
	(= (distance Washington Denver) 2397)
	(= (distance Denver Boston) 2839)
	(= (distance Boston Denver) 2839)
	(= (distance Denver Seattle) 1641)
	(= (distance Seattle Denver) 1641)
	(= (distance Denver LosAngeles) 1327)
	(= (distance LosAngeles Denver) 1327)
	(= (distance Dallas Washington) 1912)
	(= (distance Washington Dallas) 1912)
	(= (distance Dallas Boston) 2505)
	(= (distance Boston Dallas) 2505)
	(= (distance Dallas Seattle) 2705)
	(= (distance Seattle Dallas) 2705)
	(= (distance Dallas LosAngeles) 1989)
	(= (distance LosAngeles Dallas) 1989)
	(= (distance Washington Boston) 628)
	(= (distance Boston Washington) 628)
	(= (distance Washington Seattle) 3736)
	(= (distance Seattle Washington) 3736)
	(= (distance Washington LosAngeles) 3693)
	(= (distance LosAngeles Washington) 3693)
	(= (distance Boston Seattle) 4005)
	(= (distance Seattle Boston) 4005)
	(= (distance Boston LosAngeles) 4153)
	(= (distance LosAngeles Boston) 4153)
	(= (distance Seattle LosAngeles) 1548)
	(= (distance LosAngeles Seattle) 1548)

	(= (total-fuel-used) 0)
)
(:goal (and
	(located plane1 Boston)
	(located person1 Boston)
	(located person2 LosAngeles)
	(located person3 Boston)
	(located person4 Denver)
	(located person5 Washington)
	(located person6 Seattle)
	(located person8 Denver)
	(located person9 Seattle)
	(located person10 Boston)
	))

(:metric minimize (total-fuel-used))





)

; plan
1. (refuel plane1)
   changed: (fuel plane1) from 205 to 2326
   goals met: 1 of 10
2. (flyslow plane1 boston washington)
   deleted: (located plane1 boston)
   added: (located plane1 washington)
   changed: (total-fuel-used) from 0 to 628, (fuel plane1) from 2326 to 1698
   goals met: 0 of 10
3. (refuel plane1)
   changed: (fuel plane1) from 1698 to 2326
   goals met: 0 of 10
4. (flyslow plane1 washington dallas)
   deleted: (located plane1 washington)
   added: (located plane1 dallas)
   changed: (total-fuel-used) from 628 to 2540, (fuel plane1) from 2326 to 414
   goals met: 0 of 10
5. (refuel plane2)
   changed: (fuel plane2) from 1469 to 12132
   goals met: 0 of 10
6. (board person8 plane2 washington)
   deleted: (located person8 washington)
   added: (in person8 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 0 of 10
7. (flyslow plane2 washington denver)
   deleted: (located plane2 washington)
   added: (located plane2 denver)
   changed: (total-fuel-used) from 2540 to 12128, (fuel plane2) from 12132 to 2544
   goals met: 0 of 10
8. (refuel plane2)
   changed: (fuel plane2) from 2544 to 12132
   goals met: 0 of 10
9. (board person6 plane1 dallas)
   deleted: (located person6 dallas)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 10
10. (debark person8 plane2 denver)
   deleted: (in person8 plane2)
   added: (located person8 denver)
   changed: (onboard plane2) from 1 to 0
   goals met: 1 of 10
11. (board person7 plane2 denver)
   deleted: (located person7 denver)
   added: (in person7 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 10
12. (flyslow plane2 denver losangeles)
   deleted: (located plane2 denver)
   added: (located plane2 losangeles)
   changed: (total-fuel-used) from 12128 to 17436, (fuel plane2) from 12132 to 6824
   goals met: 1 of 10
13. (debark person7 plane2 losangeles)
   deleted: (in person7 plane2)
   added: (located person7 losangeles)
   changed: (onboard plane2) from 1 to 0
   goals met: 1 of 10
14. (board person5 plane2 losangeles)
   deleted: (located person5 losangeles)
   added: (in person5 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 10
15. (flyslow plane2 losangeles denver)
   deleted: (located plane2 losangeles)
   added: (located plane2 denver)
   changed: (total-fuel-used) from 17436 to 22744, (fuel plane2) from 6824 to 1516
   goals met: 1 of 10
16. (refuel plane2)
   changed: (fuel plane2) from 1516 to 12132
   goals met: 1 of 10
17. (flyslow plane2 denver washington)
   deleted: (located plane2 denver)
   added: (located plane2 washington)
   changed: (total-fuel-used) from 22744 to 32332, (fuel plane2) from 12132 to 2544
   goals met: 1 of 10
18. (refuel plane2)
   changed: (fuel plane2) from 2544 to 12132
   goals met: 1 of 10
19. (refuel plane1)
   changed: (fuel plane1) from 414 to 2326
   goals met: 1 of 10
20. (board person2 plane2 washington)
   deleted: (located person2 washington)
   added: (in person2 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 1 of 10
21. (debark person5 plane2 washington)
   deleted: (in person5 plane2)
   added: (located person5 washington)
   changed: (onboard plane2) from 2 to 1
   goals met: 2 of 10
22. (flyslow plane2 washington dallas)
   deleted: (located plane2 washington)
   added: (located plane2 dallas)
   changed: (total-fuel-used) from 32332 to 39980, (fuel plane2) from 12132 to 4484
   goals met: 2 of 10
23. (refuel plane2)
   changed: (fuel plane2) from 4484 to 12132
   goals met: 2 of 10
24. (flyslow plane2 dallas losangeles)
   deleted: (located plane2 dallas)
   added: (located plane2 losangeles)
   changed: (total-fuel-used) from 39980 to 47936, (fuel plane2) from 12132 to 4176
   goals met: 2 of 10
25. (board person3 plane1 dallas)
   deleted: (located person3 dallas)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 10
26. (board person1 plane1 dallas)
   deleted: (located person1 dallas)
   added: (in person1 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 2 of 10
27. (flyslow plane1 dallas washington)
   deleted: (located plane1 dallas)
   added: (located plane1 washington)
   changed: (total-fuel-used) from 47936 to 49848, (fuel plane1) from 2326 to 414
   goals met: 2 of 10
28. (refuel plane1)
   changed: (fuel plane1) from 414 to 2326
   goals met: 2 of 10
29. (flyfast plane1 washington boston)
   deleted: (located plane1 washington)
   added: (located plane1 boston)
   changed: (total-fuel-used) from 49848 to 51104, (fuel plane1) from 2326 to 1070
   goals met: 3 of 10
30. (board person4 plane1 boston)
   deleted: (located person4 boston)
   added: (in person4 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 3 of 10
31. (debark person1 plane1 boston)
   deleted: (in person1 plane1)
   added: (located person1 boston)
   changed: (onboard plane1) from 4 to 3
   goals met: 4 of 10
32. (board person7 plane2 losangeles)
   deleted: (located person7 losangeles)
   added: (in person7 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 4 of 10
33. (debark person2 plane2 losangeles)
   deleted: (in person2 plane2)
   added: (located person2 losangeles)
   changed: (onboard plane2) from 2 to 1
   goals met: 5 of 10
34. (debark person3 plane1 boston)
   deleted: (in person3 plane1)
   added: (located person3 boston)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 10
35. (flyslow plane1 boston washington)
   deleted: (located plane1 boston)
   added: (located plane1 washington)
   changed: (total-fuel-used) from 51104 to 51732, (fuel plane1) from 1070 to 442
   goals met: 5 of 10
36. (refuel plane1)
   changed: (fuel plane1) from 442 to 2326
   goals met: 5 of 10
37. (flyslow plane1 washington dallas)
   deleted: (located plane1 washington)
   added: (located plane1 dallas)
   changed: (total-fuel-used) from 51732 to 53644, (fuel plane1) from 2326 to 414
   goals met: 5 of 10
38. (refuel plane1)
   changed: (fuel plane1) from 414 to 2326
   goals met: 5 of 10
39. (flyslow plane1 dallas denver)
   deleted: (located plane1 dallas)
   added: (located plane1 denver)
   changed: (total-fuel-used) from 53644 to 54712, (fuel plane1) from 2326 to 1258
   goals met: 5 of 10
40. (debark person4 plane1 denver)
   deleted: (in person4 plane1)
   added: (located person4 denver)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 10
41. (flyslow plane1 denver dallas)
   deleted: (located plane1 denver)
   added: (located plane1 dallas)
   changed: (total-fuel-used) from 54712 to 55780, (fuel plane1) from 1258 to 190
   goals met: 6 of 10
42. (refuel plane2)
   changed: (fuel plane2) from 4176 to 12132
   goals met: 6 of 10
43. (board person10 plane2 losangeles)
   deleted: (located person10 losangeles)
   added: (in person10 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 6 of 10
44. (flyslow plane2 losangeles dallas)
   deleted: (located plane2 losangeles)
   added: (located plane2 dallas)
   changed: (total-fuel-used) from 55780 to 63736, (fuel plane2) from 12132 to 4176
   goals met: 6 of 10
45. (refuel plane2)
   changed: (fuel plane2) from 4176 to 12132
   goals met: 6 of 10
46. (flyslow plane2 dallas boston)
   deleted: (located plane2 dallas)
   added: (located plane2 boston)
   changed: (total-fuel-used) from 63736 to 73756, (fuel plane2) from 12132 to 2112
   goals met: 6 of 10
47. (refuel plane1)
   changed: (fuel plane1) from 190 to 2326
   goals met: 6 of 10
48. (board person3 plane2 boston)
   deleted: (located person3 boston)
   added: (in person3 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 5 of 10
49. (board person9 plane1 dallas)
   deleted: (located person9 dallas)
   added: (in person9 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 10
50. (flyfast plane1 dallas denver)
   deleted: (located plane1 dallas)
   added: (located plane1 denver)
   changed: (total-fuel-used) from 73756 to 75892, (fuel plane1) from 2326 to 190
   goals met: 5 of 10
51. (debark person10 plane2 boston)
   deleted: (in person10 plane2)
   added: (located person10 boston)
   changed: (onboard plane2) from 3 to 2
   goals met: 6 of 10
52. (refuel plane1)
   changed: (fuel plane1) from 190 to 2326
   goals met: 6 of 10
53. (flyslow plane1 denver seattle)
   deleted: (located plane1 denver)
   added: (located plane1 seattle)
   changed: (total-fuel-used) from 75892 to 77533, (fuel plane1) from 2326 to 685
   goals met: 6 of 10
54. (refuel plane1)
   changed: (fuel plane1) from 685 to 2326
   goals met: 6 of 10
55. (debark person9 plane1 seattle)
   deleted: (in person9 plane1)
   added: (located person9 seattle)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 10
56. (board person9 plane3 seattle)
   deleted: (located person9 seattle)
   added: (in person9 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 6 of 10
57. (debark person6 plane1 seattle)
   deleted: (in person6 plane1)
   added: (located person6 seattle)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 10
58. (flyslow plane1 seattle denver)
   deleted: (located plane1 seattle)
   added: (located plane1 denver)
   changed: (total-fuel-used) from 77533 to 79174, (fuel plane1) from 2326 to 685
   goals met: 7 of 10
59. (refuel plane1)
   changed: (fuel plane1) from 685 to 2326
   goals met: 7 of 10
60. (flyslow plane1 denver dallas)
   deleted: (located plane1 denver)
   added: (located plane1 dallas)
   changed: (total-fuel-used) from 79174 to 80242, (fuel plane1) from 2326 to 1258
   goals met: 7 of 10
61. (debark person9 plane3 seattle)
   deleted: (in person9 plane3)
   added: (located person9 seattle)
   changed: (onboard plane3) from 1 to 0
   goals met: 8 of 10
62. (refuel plane1)
   changed: (fuel plane1) from 1258 to 2326
   goals met: 8 of 10
63. (flyslow plane1 dallas washington)
   deleted: (located plane1 dallas)
   added: (located plane1 washington)
   changed: (total-fuel-used) from 80242 to 82154, (fuel plane1) from 2326 to 414
   goals met: 8 of 10
64. (refuel plane1)
   changed: (fuel plane1) from 414 to 2326
   goals met: 8 of 10
65. (flyslow plane1 washington boston)
   deleted: (located plane1 washington)
   added: (located plane1 boston)
   changed: (total-fuel-used) from 82154 to 82782, (fuel plane1) from 2326 to 1698
   goals met: 9 of 10
66. (debark person3 plane2 boston)
   deleted: (in person3 plane2)
   added: (located person3 boston)
   changed: (onboard plane2) from 2 to 1
   goals met: 10 of 10
